---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyItemFactory Properties
FamilyItemFactory Class See Also Send Feedback
---

The FamilyItemFactory type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also

FamilyItemFactory Class

Autodesk.Revit.Creation Namespace